Ran Plan for dir: `infra/us-east-1/dev/rds/subnet-group` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.db_subnet_group.aws_db_subnet_group.this[0] must be replaced
-/+ resource "aws_db_subnet_group" "this" {
!       arn                     = "arn:aws:rds:us-east-1:677160962006:subgrp:dev-subnet-group" -> (known after apply)
!       id                      = "dev-subnet-group" -> (known after apply)
!       name                    = "dev-subnet-group" -> "rds-dev-subnet-group" # forces replacement
+       name_prefix             = (known after apply)
!       supported_network_types = [
-           "IPV4",
        ] -> (known after apply)
!       tags                    = {
!           "Name" = "dev-subnet-group" -> "rds-dev-subnet-group"
        }
!       tags_all                = {
!           "Name"         = "dev-subnet-group" -> "rds-dev-subnet-group"
            # (5 unchanged elements hidden)
        }
!       vpc_id                  = "vpc-07838bb868f5b4c8c" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
!   db_subnet_group_arn                = "arn:aws:rds:us-east-1:677160962006:subgrp:dev-subnet-group" -> (known after apply)
!   db_subnet_group_id                 = "dev-subnet-group" -> (known after apply)
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d infra/us-east-1/dev/rds/subnet-group`
* :put_litter_in_its_place: To **delete** this plan click [here](http://k8s-default-atlantis-91ad56e657-af175fe4f3d67964.elb.us-east-1.amazonaws.com/lock?id=input-output-hk%252Fsc-dev-platform%252Finfra%252Fus-east-1%252Fdev%252Frds%252Fsubnet-group%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d infra/us-east-1/dev/rds/subnet-group -- -destroy`
</details>
Plan: 1 to add, 0 to change, 1 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`